Процедура СоздатьПредопределенныеЭлементыСправочников() Экспорт

	ИмяСправочника = "eco_СтатусыОбращенийВТехподдержку";
	МассивЭлементовСправочника = Новый Массив;
	МассивЭлементовСправочника.Добавить(Новый Структура("Наименование", "Новая"));
	ЗаполнитьПредопределенныеЭлементыПоСправочнику(ИмяСправочника, МассивЭлементовСправочника);
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеЭлементыПоСправочнику(ИмяСправочника, МассивЭлементовСправочника)

	Для Каждого ПредопределенныйЭлемент Из МассивЭлементовСправочника Цикл
		Попытка
			Если Справочники[ИмяСправочника].НайтиПоНаименованию(ПредопределенныйЭлемент.Наименование) = Неопределено Тогда
				НовыйЭлемент = Справочники[ИмяСправочника].СоздатьЭлемент();
				//Новый
			КонецЕсли;
		Исключение
			//Запись в журнал об ошибке	
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
